/*=====================================================================================================================================================================================*/
/*=====================================================================================================================================================================================*/
/*=====================================================================================================================================================================================*/
//                                                                           Central Processing Unit
/*=====================================================================================================================================================================================*/
/*=====================================================================================================================================================================================*/
/*=====================================================================================================================================================================================*/

#ifndef CPU_H
#define CPU_H

#include <stdio.h>
#include <stdlib.h>
#include <string.h>
#include <stdint.h>
#include <stdbool.h>
#include <math.h>
#include "stack.h"
#include "isa.h"

//===== cpu_err_t коды процессорных ошибок =====
typedef enum
{
    CPU_OK              = 0,
    CPU_STACK_FAIL      = 1,
    CPU_DIV_BY_ZERO     = 2,
    CPU_UNKNOWN_OPCODE  = 3,
    CPU_MISSING_ARG     = 4,
    CPU_PC_OUT_OF_RANGE = 5,
    CPU_BAD_REGISTER    = 6,
    CPU_BAD_ADDRESS     = 7
} cpu_err_t;
//==============================================

//============ CPU - структура нашего процессора =============
typedef struct
{
    my_stack_t  stack;
    code_t*     code;              // наш байт-код
    size_t      code_size;         // количество чисел в массиве
    Elem_t      regs[REG_COUNT];   // массив регистров процессора
    int         pc;                // для будущих JMP
    int         running;           // запущена ли прога
    err_t       stack_err;         // последняя ошибка стека 
} CPU;
//=============================================================

cpu_err_t   cpu_ctor(CPU* cpu, code_t* code, size_t code_size);  // функция создающая        cpu
cpu_err_t   cpu_dtor(CPU* cpu);                                  // функция разрушающая      cpu
cpu_err_t   cpu_run( CPU* cpu);                                  // функция запускающая      cpu
const char* cpu_strerror(cpu_err_t err);                         // функция обработки ошибок cpu

#endif //CPU_H