/*=====================================================================================================================================================================================*/
/*=====================================================================================================================================================================================*/
/*=====================================================================================================================================================================================*/
//                                                                           Instruction Set Architecture
/*=====================================================================================================================================================================================*/
/*=====================================================================================================================================================================================*/
/*=====================================================================================================================================================================================*/
#ifndef ISA_H
#define ISA_H

#include "stack.h"

#define CMD_MASK 0x1F      // младшие 5 бит - номер команды
#define BIT_IMM  (1 << 5)  // дальше идёт число
#define BIT_REG  (1 << 6)  // дальше идёт регистр
#define BIT_MEM  (1 << 7)  // операнд в оперативке

#define CELL_OP(cell)    ((cell) & (CMD_MASK))    //ячейка операции
#define CELL_FLAGS(cell) ((cell) & (~(CMD_MASK))) //ячейка с флагами

//===== Одна ячейка байт-кода =====
typedef int code_t;
//=================================

//====== Opcode - хранит код процессорной операции ======
typedef enum 
{
    CMD_HLT  = 0,
    CMD_PUSH = 1,
    CMD_ADD  = 2,
    CMD_SUB  = 3,
    CMD_MUL  = 4,
    CMD_DIV  = 5,
    CMD_OUT  = 6,

    CMD_COUNT           // определяет количество команд
} Opcode;
//=======================================================

//=== ComandInfo - структура хранящая название процессорной команды и её тип ===
typedef struct
{
    const char* name;
    int         allowed;   // разврешённые флаги
} CommandInfo;
//==============================================================================

//==== isa - этот массив определяет какие команды может исполнять процессор на физическом уровне и определяет их тип ====//
extern const CommandInfo isa[CMD_COUNT];
//=======================================================================================================================//

bool is_valid_opcode(code_t v);      // проверяет валидность команды к процессору
bool isa_cell_ok(code_t cell);       // номер и флаги допустимы вместе
int  operand_cells(int flags);       // сколько ячеек операндов идёт после
int  find_command(const char* word); // функция распознания команды


#endif //ISA_H